<?php

use yii\db\Migration;

/**
 * Class m180917_213538_script_add_data
 */
class m180917_213538_script_add_data extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        // добавляем строки в таблицу channel
        $this->batchInsert('channel',
            ['name','isHD','image'],
            [
                ['Первый канал',0,''],
                ['Россия-1',0,''],
                ['Первый-HD',1,''],
                ['Рен-тв',0,''],
                ['Россия-1 HD',1,''],
                ['СТС',0,''],
                ['ТНТ HD',1,''],
            ]);

        $this->batchInsert('channelcategory',
            ['name'],[
                ['Новостной'],
                ['Развлекательный'],
                ['Спортивный'],
                ['Детский'],
                ['Общий'],
            ]);

        $this->batchInsert('channelpackage',
            ['name'],[
                ['Мне нравится'],
                ['Микс'],
                ['Стартовый'],
                ['Кино и музыка'],
            ]);

        $this->batchInsert('genre',
            ['name'],[
                ['Новости'],
                ['Сериал'],
                ['Кино'],
                ['Спорт'],
            ]);

        $this->batchInsert('programm',
            ['name'],[
                ['Новости'],
                ['Модный приговор'],
                ['Контрольная закупка'],
                ['Время'],
                ['Сегодня вечером'],
                ['Маша и Медведь'],
                ['Сто к одному'],
                ['Вести'],
                ['Россия. Местное время'],
                ['Пес'],
                ['Свои'],
                ['Их нравы'],
                ['Военная тайна'],
            ]);

        $this->batchInsert('user',
            ['login','password','token'],[
                ['admin','','123'],
            ]);

        $this->batchInsert('genre_programm',
            ['genre_id','programm_id'],[
                [1,1],
                [1,4],
                [1,8],
                [1,9],
                [2,6],
                [2,11],
                [2,10],
                [2,5],
                [3,12],
                [3,13],
                [3,3],
                [4,2],
                [4,12],
                [4,5],
            ]);

        $this->batchInsert('channel_programm',
            ['channel_id','programm_id','time','date','HD'],[
                [1,1,'08:00','2018-09-01',0],
                [1,2,'10:00','2018-09-01',0],
                [1,3,'12:00','2018-09-01',0],
                [1,1,'14:00','2018-09-01',0],
                [1,2,'16:00','2018-09-01',0],
                [1,11,'18:00','2018-09-01',0],
                [1,4,'20:00','2018-09-01',0],
                [1,11,'22:00','2018-09-01',0],
                [1,8,'24:00','2018-09-01',0],
                [3,1,'08:00','2018-09-02',1],
                [3,3,'10:00','2018-09-02',1],
                [3,2,'12:00','2018-09-02',1],
                [3,1,'14:00','2018-09-02',1],
                [3,6,'16:00','2018-09-02',1],
                [3,10,'18:00','2018-09-02',1],
                [3,4,'20:00','2018-09-02',1],
                [3,5,'22:00','2018-09-02',1],
                [3,2,'24:00','2018-09-02',1],
                [2,8,'08:00','2018-09-03',0],
                [2,11,'10:00','2018-09-03',0],
                [2,7,'12:00','2018-09-03',0],
                [2,9,'14:00','2018-09-03',0],
                [2,2,'16:00','2018-09-03',0],
                [2,6,'18:00','2018-09-03',0],
                [2,10,'20:00','2018-09-03',0],
                [2,8,'22:00','2018-09-03',0],
                [2,10,'24:00','2018-09-03',0],
                [5,4,'08:00','2018-09-04',1],
                [5,7,'10:00','2018-09-04',1],
                [5,3,'12:00','2018-09-04',1],
                [5,6,'14:00','2018-09-04',1],
                [5,9,'16:00','2018-09-04',1],
                [5,11,'18:00','2018-09-04',1],
                [5,12,'20:00','2018-09-04',1],
                [5,9,'22:00','2018-09-04',1],
                [5,5,'24:00','2018-09-04',1],
                [3,1,'08:00','2018-09-01',1],
                [3,3,'10:00','2018-09-01',1],
                [3,2,'12:00','2018-09-01',1],
                [3,1,'14:00','2018-09-01',1],
                [3,6,'16:00','2018-09-01',1],
                [3,10,'18:00','2018-09-01',1],
                [3,4,'20:00','2018-09-01',1],
                [3,5,'22:00','2018-09-01',1],
                [3,2,'24:00','2018-09-01',1],
                [2,8,'08:00','2018-09-01',0],
                [2,11,'10:00','2018-09-01',0],
                [2,7,'12:00','2018-09-01',0],
                [2,9,'14:00','2018-09-01',0],
                [2,2,'16:00','2018-09-01',0],
                [2,6,'18:00','2018-09-01',0],
                [2,10,'20:00','2018-09-01',0],
                [2,8,'22:00','2018-09-01',0],
                [2,10,'24:00','2018-09-01',0],
                [5,4,'08:00','2018-09-01',1],
                [5,7,'10:00','2018-09-01',1],
                [5,3,'12:00','2018-09-01',1],
                [5,6,'14:00','2018-09-01',1],
                [5,9,'16:00','2018-09-01',1],
                [5,11,'18:00','2018-09-01',1],
                [5,12,'20:00','2018-09-01',1],
                [5,9,'22:00','2018-09-01',1],
                [5,5,'24:00','2018-09-01',1],
            ]);

        $this->batchInsert('channel_channelpackage',
            ['channel_id','package_id'],[
                [1,3],
                [1,2],
                [3,2],
                [2,3],
                [2,2],
                [2,1],
                [5,1],
                [4,1],
                [4,3],
                [4,4],
                [6,1],
                [6,2],
                [6,3],
                [6,4],
                [7,3],
                [7,4],
                [7,1],
            ]);

        $this->batchInsert('channel_channelcategory',
            ['channel_id','category_id'],[
                [1,1],
                [1,5],
                [3,1],
                [2,5],
                [2,1],
                [2,5],
                [5,1],
                [5,5],
                [4,2],
                [4,5],
                [4,4],
                [6,2],
                [6,5],
                [6,4],
                [7,5],
                [7,2],
            ]);

    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        echo "m180917_213538_script_add_data cannot be reverted.\n";
        $this->truncateTable('channel_channelcategory');
        $this->truncateTable('channel_channelpackage');
        $this->truncateTable('channel_programm');
        $this->truncateTable('genre_programm');
        $this->truncateTable('user');
        $this->truncateTable('programm');
        $this->truncateTable('genre');
        $this->truncateTable('channelpackage');
        $this->truncateTable('channelcategory');
        $this->truncateTable('channel');

        return false;
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m180917_213538_script_add_data cannot be reverted.\n";

        return false;
    }
    */
}
